## Model Validation
- Step 0: Training-validation data split
- Step 1: Data analysis
- Step 2: Classification
- **Step 3: Model Validation**
	- Generating a Kaggle submission
	- Analysis of the results

In [1]:
% matplotlib qt

import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from IPython.display import display
import modules.utilgen as utgen
import modules.model_framework.model as mdl
import modules.data_framework.data_pipeline as dtp
from modules.utilgen import viewdf
import itertools

% reload_ext autoreload
% autoreload 2

WARNING (theano.tensor.blas): Using NumPy C-API based implementation for BLAS functions.

D:\SoftwareWork\PythonProjects\Miniconda\envs\datascience1\lib\site-packages\h5py\__init__.py:36: FutureWarning: Conversion of the second argument of issubdtype from `float` to `np.floating` is deprecated. In future, it will be treated as `np.float64 == np.dtype(float).type`.
  from ._conv import register_converters as _register_converters

### Load data

In [2]:
version = 5
dataPath = os.path.join('data', 'data_derived', 'train.csv')
dataTPath = os.path.join('data', 'data_derived', 'test.csv')
submissionPath = os.path.join('data', 'data_derived', 'submission.csv')
data = pd.read_csv(dataPath, index_col=0)
dataT = pd.read_csv(dataTPath, index_col=0)
with utgen.printOptions(precision=2):
    print('---------- Original Data (Train) -----------')
    display(data.sample(n=5))
    display(data.describe())
    print('---------- Original Data (Test) -----------')
    dataT.insert(loc=0, column='Survived', value=0)
    display(dataT.sample(n=5))
    display(dataT.describe())
    print('---------- Clean Data (Train) -----------')
    data, dataT = dtp.featuresPipelineTrainTest(data, dataT, version=version)
    dataT.Survived = np.nan
    display(data.sample(n=5))
    display(data.describe())
    print('---------- Clean Data (Test) -----------')
    display(dataT.sample(n=5))
    display(dataT.describe())

---------- Original Data (Train) -----------

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
    <tr>
      <th>PassengerId</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>515</th>
      <td>0</td>
      <td>3</td>
      <td>Coleff, Mr. Satio</td>
      <td>male</td>
      <td>24.00</td>
      <td>0</td>
      <td>0</td>
      <td>349209</td>
      <td>7.50</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>600</th>
      <td>1</td>
      <td>1</td>
      <td>Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")</td>
      <td>male</td>
      <td>49.00</td>
      <td>1</td>
      <td>0</td>
      <td>PC 17485</td>
      <td>56.93</td>
      <td>A20</td>
      <td>C</td>
    </tr>
    <tr>
      <th>352</th>
      <td>0</td>
      <td>1</td>
      <td>Williams-Lambert, Mr. Fletcher Fellows</td>
      <td>male</td>
      <td>nan</td>
      <td>0</td>
      <td>0</td>
      <td>113510</td>
      <td>35.00</td>
      <td>C128</td>
      <td>S</td>
    </tr>
    <tr>
      <th>632</th>
      <td>0</td>
      <td>3</td>
      <td>Lundahl, Mr. Johan Svensson</td>
      <td>male</td>
      <td>51.00</td>
      <td>0</td>
      <td>0</td>
      <td>347743</td>
      <td>7.05</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>109</th>
      <td>0</td>
      <td>3</td>
      <td>Rekic, Mr. Tido</td>
      <td>male</td>
      <td>38.00</td>
      <td>0</td>
      <td>0</td>
      <td>349249</td>
      <td>7.90</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
  </tbody>
</table>
</div>

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Fare</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>891.00</td>
      <td>891.00</td>
      <td>714.00</td>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>0.38</td>
      <td>2.31</td>
      <td>29.70</td>
      <td>0.52</td>
      <td>0.38</td>
      <td>32.20</td>
    </tr>
    <tr>
      <th>std</th>
      <td>0.49</td>
      <td>0.84</td>
      <td>14.53</td>
      <td>1.10</td>
      <td>0.81</td>
      <td>49.69</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.00</td>
      <td>1.00</td>
      <td>0.42</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>0.00</td>
      <td>2.00</td>
      <td>20.12</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>7.91</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>0.00</td>
      <td>3.00</td>
      <td>28.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>14.45</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>1.00</td>
      <td>3.00</td>
      <td>38.00</td>
      <td>1.00</td>
      <td>0.00</td>
      <td>31.00</td>
    </tr>
    <tr>
      <th>max</th>
      <td>1.00</td>
      <td>3.00</td>
      <td>80.00</td>
      <td>8.00</td>
      <td>6.00</td>
      <td>512.33</td>
    </tr>
  </tbody>
</table>
</div>

---------- Original Data (Test) -----------

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
    <tr>
      <th>PassengerId</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1276</th>
      <td>0</td>
      <td>2</td>
      <td>Wheeler, Mr. Edwin Frederick""</td>
      <td>male</td>
      <td>nan</td>
      <td>0</td>
      <td>0</td>
      <td>SC/PARIS 2159</td>
      <td>12.88</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>1151</th>
      <td>0</td>
      <td>3</td>
      <td>Midtsjo, Mr. Karl Albert</td>
      <td>male</td>
      <td>21.00</td>
      <td>0</td>
      <td>0</td>
      <td>345501</td>
      <td>7.78</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>1225</th>
      <td>0</td>
      <td>3</td>
      <td>Nakid, Mrs. Said (Waika Mary" Mowad)"</td>
      <td>female</td>
      <td>19.00</td>
      <td>1</td>
      <td>1</td>
      <td>2653</td>
      <td>15.74</td>
      <td>NaN</td>
      <td>C</td>
    </tr>
    <tr>
      <th>1210</th>
      <td>0</td>
      <td>3</td>
      <td>Jonsson, Mr. Nils Hilding</td>
      <td>male</td>
      <td>27.00</td>
      <td>0</td>
      <td>0</td>
      <td>350408</td>
      <td>7.85</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>979</th>
      <td>0</td>
      <td>3</td>
      <td>Badman, Miss. Emily Louisa</td>
      <td>female</td>
      <td>18.00</td>
      <td>0</td>
      <td>0</td>
      <td>A/4 31416</td>
      <td>8.05</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
  </tbody>
</table>
</div>

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Fare</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>418.00</td>
      <td>418.00</td>
      <td>332.00</td>
      <td>418.00</td>
      <td>418.00</td>
      <td>417.00</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>0.00</td>
      <td>2.27</td>
      <td>30.27</td>
      <td>0.45</td>
      <td>0.39</td>
      <td>35.63</td>
    </tr>
    <tr>
      <th>std</th>
      <td>0.00</td>
      <td>0.84</td>
      <td>14.18</td>
      <td>0.90</td>
      <td>0.98</td>
      <td>55.91</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.00</td>
      <td>1.00</td>
      <td>0.17</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>0.00</td>
      <td>1.00</td>
      <td>21.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>7.90</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>0.00</td>
      <td>3.00</td>
      <td>27.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>14.45</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>0.00</td>
      <td>3.00</td>
      <td>39.00</td>
      <td>1.00</td>
      <td>0.00</td>
      <td>31.50</td>
    </tr>
    <tr>
      <th>max</th>
      <td>0.00</td>
      <td>3.00</td>
      <td>76.00</td>
      <td>8.00</td>
      <td>9.00</td>
      <td>512.33</td>
    </tr>
  </tbody>
</table>
</div>

---------- Clean Data (Train) -----------

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Fare</th>
      <th>EmbarkedC</th>
      <th>EmbarkedS</th>
      <th>Female</th>
    </tr>
    <tr>
      <th>PassengerId</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>367</th>
      <td>1</td>
      <td>1</td>
      <td>60.00</td>
      <td>1</td>
      <td>0</td>
      <td>75.25</td>
      <td>1</td>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>757</th>
      <td>0</td>
      <td>3</td>
      <td>28.00</td>
      <td>0</td>
      <td>0</td>
      <td>7.80</td>
      <td>0</td>
      <td>1</td>
      <td>0</td>
    </tr>
    <tr>
      <th>386</th>
      <td>0</td>
      <td>2</td>
      <td>18.00</td>
      <td>0</td>
      <td>0</td>
      <td>73.50</td>
      <td>0</td>
      <td>1</td>
      <td>0</td>
    </tr>
    <tr>
      <th>650</th>
      <td>1</td>
      <td>3</td>
      <td>23.00</td>
      <td>0</td>
      <td>0</td>
      <td>7.55</td>
      <td>0</td>
      <td>1</td>
      <td>1</td>
    </tr>
    <tr>
      <th>448</th>
      <td>1</td>
      <td>1</td>
      <td>34.00</td>
      <td>0</td>
      <td>0</td>
      <td>26.55</td>
      <td>0</td>
      <td>1</td>
      <td>0</td>
    </tr>
  </tbody>
</table>
</div>

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Fare</th>
      <th>EmbarkedC</th>
      <th>EmbarkedS</th>
      <th>Female</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
      <td>891.00</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>0.38</td>
      <td>2.31</td>
      <td>29.60</td>
      <td>0.40</td>
      <td>0.36</td>
      <td>29.74</td>
      <td>0.19</td>
      <td>0.73</td>
      <td>0.35</td>
    </tr>
    <tr>
      <th>std</th>
      <td>0.49</td>
      <td>0.84</td>
      <td>13.23</td>
      <td>0.64</td>
      <td>0.72</td>
      <td>35.95</td>
      <td>0.39</td>
      <td>0.45</td>
      <td>0.48</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.00</td>
      <td>1.00</td>
      <td>0.42</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>0.00</td>
      <td>2.00</td>
      <td>21.69</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>7.91</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>0.00</td>
      <td>3.00</td>
      <td>28.67</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>14.45</td>
      <td>0.00</td>
      <td>1.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>1.00</td>
      <td>3.00</td>
      <td>37.00</td>
      <td>1.00</td>
      <td>0.00</td>
      <td>31.00</td>
      <td>0.00</td>
      <td>1.00</td>
      <td>1.00</td>
    </tr>
    <tr>
      <th>max</th>
      <td>1.00</td>
      <td>3.00</td>
      <td>71.24</td>
      <td>2.00</td>
      <td>3.00</td>
      <td>169.73</td>
      <td>1.00</td>
      <td>1.00</td>
      <td>1.00</td>
    </tr>
  </tbody>
</table>
</div>

---------- Clean Data (Test) -----------

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Fare</th>
      <th>EmbarkedC</th>
      <th>EmbarkedS</th>
      <th>Female</th>
    </tr>
    <tr>
      <th>PassengerId</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1197</th>
      <td>nan</td>
      <td>1</td>
      <td>64.00</td>
      <td>1</td>
      <td>1</td>
      <td>26.55</td>
      <td>0</td>
      <td>1</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1157</th>
      <td>nan</td>
      <td>3</td>
      <td>28.67</td>
      <td>0</td>
      <td>0</td>
      <td>7.90</td>
      <td>0</td>
      <td>1</td>
      <td>0</td>
    </tr>
    <tr>
      <th>1045</th>
      <td>nan</td>
      <td>3</td>
      <td>36.00</td>
      <td>0</td>
      <td>2</td>
      <td>12.18</td>
      <td>0</td>
      <td>1</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1092</th>
      <td>nan</td>
      <td>3</td>
      <td>28.67</td>
      <td>0</td>
      <td>0</td>
      <td>15.50</td>
      <td>0</td>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>986</th>
      <td>nan</td>
      <td>1</td>
      <td>25.00</td>
      <td>0</td>
      <td>0</td>
      <td>26.00</td>
      <td>1</td>
      <td>0</td>
      <td>0</td>
    </tr>
  </tbody>
</table>
</div>

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Fare</th>
      <th>EmbarkedC</th>
      <th>EmbarkedS</th>
      <th>Female</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>0.00</td>
      <td>418.00</td>
      <td>418.00</td>
      <td>418.00</td>
      <td>418.00</td>
      <td>418.00</td>
      <td>418.00</td>
      <td>418.00</td>
      <td>418.00</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>nan</td>
      <td>2.27</td>
      <td>30.04</td>
      <td>0.38</td>
      <td>0.35</td>
      <td>32.04</td>
      <td>0.24</td>
      <td>0.65</td>
      <td>0.36</td>
    </tr>
    <tr>
      <th>std</th>
      <td>nan</td>
      <td>0.84</td>
      <td>12.75</td>
      <td>0.60</td>
      <td>0.72</td>
      <td>40.70</td>
      <td>0.43</td>
      <td>0.48</td>
      <td>0.48</td>
    </tr>
    <tr>
      <th>min</th>
      <td>nan</td>
      <td>1.00</td>
      <td>0.17</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>nan</td>
      <td>1.00</td>
      <td>22.00</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>7.90</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>nan</td>
      <td>3.00</td>
      <td>28.67</td>
      <td>0.00</td>
      <td>0.00</td>
      <td>14.45</td>
      <td>0.00</td>
      <td>1.00</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>nan</td>
      <td>3.00</td>
      <td>36.38</td>
      <td>1.00</td>
      <td>0.00</td>
      <td>31.47</td>
      <td>0.00</td>
      <td>1.00</td>
      <td>1.00</td>
    </tr>
    <tr>
      <th>max</th>
      <td>nan</td>
      <td>3.00</td>
      <td>71.24</td>
      <td>2.00</td>
      <td>3.00</td>
      <td>169.73</td>
      <td>1.00</td>
      <td>1.00</td>
      <td>1.00</td>
    </tr>
  </tbody>
</table>
</div>

### Fit a voting classifier
#### - selected based on the results in run_model.ipynb
#### - CV is increased from 5 to 10

In [10]:
BaseModels = [['Logistic', mdl.Logistic(fit_intercept=False, scale=False, C=10)]]
for i, j in itertools.product([5, 10, 20], ['uniform']):
    BaseModels += [['KNN_{}_{}'.format(i, j), mdl.KNN(scale=False, n_neighbors=i, weights=j)]]
for i, j, k in itertools.product([0.12, 0.06], [1., 0.8], [4, 8]):
    BaseModels += [['BoostedTree_learn{}_sub{}_leaf{}'.format(i, j, k),
                    mdl.BoostedTree(scale=False, n_estimators=256, loss='deviance', learning_rate=i, subsample=j,
                                    max_features=None, max_depth=None, max_leaf_nodes=k, random_state=1,
                                    balanceWeights=True)]]
for i in [8, 16, 32]:
    BaseModels += [['RandomForest_leaf{}'.format(i),
                    mdl.RandomForest(scale=False, n_estimators=256, max_features=None, max_depth=None,
                                     max_leaf_nodes=i, class_weight='balanced', random_state=1)]]
for i, j in itertools.product([2, 4], [0.06, 0.12, 0.25]):
    BaseModels += [['SVM_degree{}_gamma{}'.format(i, j),
                    mdl.SVM(scale=False, C=0.25, kernel='poly', degree=i, gamma=j, class_weight='balanced',
                            random_state=1)]]
for i in [0.25, 0.5, 1., 2.]:
    BaseModels += [['LinearLocal_bw{}'.format(i),
                    mdl.LogisticLinearLocal(scale=False, reg_type='ll', bw=i)]]
 
ModelVoteRegress = mdl.VoteRegress(cv=10, scale=True, Models=BaseModels, voting='soft', loss='devianceNormalized',
                                   baseClassifiersInfo=False)
ModelVoteRegress.fit(data)
ModelVoteRegress.predict(dataT)
ModelVoteRegress.printPlotSummary(cv=10)

****** VOTE REGRESS ******

-----Train and Test Sets-----

Sample Size (Train / Test): 891 / 418

Survived Rate (Train / Test): 0.38 / nan

-----Performance-----

accuracy	 (IS / CV / OOS): 0.92 / 0.83 (0.03) / nan

accproba	 (IS / CV / OOS): 0.76 / 0.72 (0.02) / nan

logproba	 (IS / CV / OOS): -0.31 / -0.42 (0.05) / nan

aucproba	 (IS / CV / OOS): 0.97 / 0.88 (0.04) / nan

recall	 (IS / CV / OOS): 0.87 / 0.75 (0.09) / nan

precision	 (IS / CV / OOS): 0.91 / 0.78 (0.07) / nan

-----Confusion (IS)-----

   0-pred  1-pred
0    0.58    0.03
1    0.05    0.33

-----Confusion (OOS)-----

  0-pred 1-pred
0    NaN    NaN
1    NaN    NaN

-----Weights-----

BoostedTree_learn0.12_sub1.0_leaf8 = 0.32

RandomForest_leaf8 = 0.30

LinearLocal_bw2.0 = 0.29

BoostedTree_learn0.12_sub0.8_leaf8 = 0.14

KNN_20_uniform = 0.07

RandomForest_leaf32 = 0.01

SVM_degree2_gamma0.12 = 0.01

SVM_degree2_gamma0.06 = 0.00

SVM_degree4_gamma0.12 = 0.00

SVM_degree4_gamma0.06 = 0.00

SVM_degree2_gamma0.25 = 0.00

<TEST OUTCOMES ARE NOT VALID: ROC PLOT IS NOT AVAILABLE>

### Write the submission file

In [11]:
submissionPath = os.path.join('data', 'data_derived', 'submission.csv')
submission = pd.DataFrame(index=dataT.index, columns=['Survived'])
submission.loc[:, 'Survived'] = ModelVoteRegress.ytH
submission.head()
submission.to_csv(submissionPath, index_label='PassengerId')